{
    "portfolio":
    [
        {
            "id": 1,
            "nama": "Hangari Haven (Restful XML Restoran)",
            "foto": "assets/img/portfolio/portofolio-restful-xml-restoran.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-restful-xml-restoran-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-restful-xml-restoran-2.png",
            "filter": "filter-web",
            "tools": "PHP, Bootstrap, HTML, CSS, JavaScript, SCSS",
            "kategori": "Web",
            "client": "Project Sistem Terdistribusi dan Keamanan",
            "date_project": "2020",
            "url_project": "https://github.com/ZuyinatinK/restful-xml-restoran",
            "keterangan": "Website restoran Korea yang menarik ini menawarkan pengalaman visual yang menggugah selera dengan latar belakang makanan Korea yang menggoda pada halaman utama. Hangari Haven memanfaatkan server Debian 11.05 untuk menyimpan sebagian code dan database, serta diakses melalui client Windows. Pengunjung dapat menemukan informasi lengkap tentang restoran, termasuk deskripsi singkat, foto chef, dan data menu yang tersimpan di server. Admin memiliki akses ke dashboard manajemen data yang memungkinkan CRUD data menu serta upload foto makanan dan minuman, menjadikan website ini solusi ideal untuk mengelola dan mempromosikan restoran Korea secara digital."
        },
        {
            "id": 2,
            "nama": "SIDESTEP: Sistem Pendukung Keputusan Penentuan Masa Manfaat dan Nilai Penyusutan Sarana Prasarana",
            "foto": "assets/img/portfolio/portofolio-si_sarpras.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-si_sarpras-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-si_sarpras-2.png",
            "filter": "filter-web",
            "tools": "CodeIgniter, PHP, Bootstrap, HTML, CSS, JavaScript",
            "kategori": "Web",
            "client": "Project Akhir Skripsi",
            "date_project": "2023",
            "url_project": "https://github.com/ZuyinatinK/DSS-Useful-Life-and-Depreciation-Value-of-Infrastructure-Facilities",
            "keterangan": "Sistem Pendukung Keputusan (SPK) ini dirancang untuk menentukan masa manfaat dan nilai penyusutan sarana prasarana menggunakan metode MULTIMOORA. Website ini memiliki dua role user, yaitu admin dan pengunjung, yang masing-masing memiliki akses ke halaman profile, dashboard, dan pengelolaan data SARPRAS. Admin dapat melakukan manajemen pengguna, kriteria dan sub kriteria, bobot, alternatif, serta seluruh data sarana prasarana kantor. Pengunjung juga memiliki akses untuk melihat dan mengelola data serta melakukan analisis MULTIMOORA hingga proses perangkingan. Dengan fitur yang lengkap dan terstruktur, SIDESTEP membantu dalam pengambilan keputusan yang lebih terstruktur dan akurat dalam manajemen aset."
        },
        {
            "id": 3,
            "nama": "VisRove (Visit Bali’s Mangrove Forest)",
            "foto": "assets/img/portfolio/portofolio-si_mangrove.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-si_mangrove-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-si_mangrove-2.png",
            "filter": "filter-web",
            "tools": "CodeIgniter, PHP, Bootstrap, HTML, CSS, JavaScript, SCSS, Leaflet",
            "kategori": "Web",
            "client": "Project Akhir Geographic Information System",
            "date_project": "2022",
            "url_project": "https://github.com/ZuyinatinK/bali-mangrove-forest",
            "keterangan": "Website ini merupakan Sistem Informasi Geografis (GIS) yang dirancang untuk memetakan tempat-tempat ekowisata hutan mangrove di Pulau Bali. Dengan tampilan yang menarik dan latar belakang pemandangan pohon mangrove, website ini memberikan informasi lengkap mengenai berbagai destinasi ekowisata mangrove. Pengunjung dapat menjelajahi peta interaktif yang menampilkan lokasi hutan mangrove dengan detail nama tempat, alamat, serta koordinat geografisnya. Selain itu, terdapat halaman dokumentasi yang memamerkan foto-foto destinasi wisata, tim pengembang website, serta informasi kontak yang dapat diakses dengan mudah. Admin yang memiliki akses login dapat mengelola seluruh data destinasi hutan mangrove melalui dashboard yang dilengkapi dengan fitur CRUD untuk manajemen data secara efektif."
        },
        {
            "id": 4,
            "nama": "CosmeticsSafety",
            "foto": "assets/img/portfolio/portofolio-si_produkhalal.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-si_produkhalal-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-si_produkhalal-2.png",
            "filter": "filter-web",
            "tools": "CodeIgniter, PHP, Bootstrap, HTML, CSS, JavaScript",
            "kategori": "Web",
            "client": "Project Akhir Framework Programming",
            "date_project": "2022",
            "url_project": "https://github.com/ZuyinatinK/pengecekan-produk-kosmetik",
            "keterangan": "CosmeticsSafety adalah sebuah Sistem Informasi Pengecekan Keamanan dan Kehalalan Produk Kosmetik yang dirancang untuk memudahkan konsumen dalam memastikan produk kosmetik yang mereka gunakan aman dan halal. Website ini dilengkapi dengan halaman 'home' yang menjadi daya tarik utama, 'about' yang memberikan deskripsi singkat serta informasi mengenai jumlah jenis produk, jumlah produk, dan jumlah produsen. Halaman 'product' memungkinkan konsumen untuk mengecek status keamanan dan kehalalan produk melalui fitur search bar yang intuitif. Selain itu, website ini juga menyajikan artikel informatif di halaman 'blog' dan menyediakan informasi kontak serta peta lokasi di halaman 'contact'."
        },
        {
            "id": 5,
            "nama": "REST API Rental menggunakan Golang",
            "foto": "assets/img/portfolio/portofolio-go-rest-api-rental.png",
            "foto_detail_1": "assets/img/portfolio/portofolio-details-go-rest-api-rental-1.png",
            "foto_detail_2": "assets/img/portfolio/portofolio-details-go-rest-api-rental-2.png",
            "filter": "filter-web",
            "tools": "Golang",
            "kategori": "Web",
            "client": "Project Akhir Pelatihan",
            "date_project": "2023",
            "url_project": "https://github.com/ZuyinatinK/go-rest-api-rental",
            "keterangan": "Program ini merupakan implementasi REST API untuk sistem rental properti yang dibangun menggunakan bahasa pemrograman Golang. Dengan memanfaatkan berbagai library seperti Gorm untuk ORM, Viper untuk konfigurasi, Gorilla/Mux untuk routing HTTP, dan Logrus untuk logging, program ini menawarkan performa tinggi dan fleksibilitas. Program ini mengelola dua tabel utama: tabel properti yang mencatat semua detail properti yang tersedia seperti rumah, apartemen, dan penthouses, serta tabel tenant yang menyimpan data penyewa dengan foreign key yang terhubung ke properti yang disewa. Program ini juga dilengkapi dengan Air, tools live reload yang memudahkan proses pengembangan aplikasi secara dinamis."
        },
        {
            "id": 6,
            "nama": "Company Profile Kopi Kuy",
            "foto": "assets/img/portfolio/portofolio-kopi-kuy.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-kopi-kuy-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-kopi-kuy-2.png",
            "filter": "filter-web",
            "tools": "HTML, CSS, JavaScript, JSON, JQuery",
            "kategori": "Web",
            "client": "Project Akhir Pelatihan",
            "date_project": "2023",
            "url_project": "https://github.com/ZuyinatinK/kopi-kuy",
            "keterangan": "Website ini dirancang dengan tampilan menarik yang menonjolkan identitas dan keunikan Kopi Kuy, sebuah coffee shop yang dikenal dengan menu andalan mereka. Pada halaman utama, pengunjung disambut dengan nama coffee shop dan penjelasan singkat tentang tempat ini. Selain itu, website ini juga menampilkan daftar menu best seller, informasi singkat tentang coffee shop, profil anggota tim, serta testimoni dari pelanggan. Halaman contact us memudahkan pengunjung menemukan lokasi coffee shop melalui peta (Google Maps) dan alamat lengkap. Di halaman produk, tersedia katalog kopi dan produk non-kopi mentah yang dapat dibeli, dengan tampilan menarik yang langsung mengarahkan pelanggan ke link online shop untuk kemudahan pembelian."
        },
        {
            "id": 7,
            "nama": "Simpera-SP: Sistem Pengendalian Pemeliharaan Sarana Prasarana",
            "foto": "assets/img/portfolio/portofolio-si_assets.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-si_assets-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-si_assets-2.png",
            "filter": "filter-web",
            "tools": "CodeIgniter, PHP, Bootstrap, HTML, CSS, JavaScript",
            "kategori": "Web",
            "client": "Project Akhir Magang",
            "date_project": "2021",
            "url_project": "https://github.com/ZuyinatinK/SIMPERA-SP-DPMD-Kab-Jombang",
            "keterangan": "SIMPERA-SP adalah Sistem Pengendalian Pemeliharaan Sarana Prasarana yang dibuat untuk mempermudah monitoring dan manajemen aset di Dinas Pemberdayaan Masyarakat dan Desa Kabupaten Jombang. Website ini memiliki dua jenis akses, yaitu untuk pengunjung yang hanya bisa melihat halaman home dengan informasi dasar seperti jumlah kendaraan, AC, dan pengolah data, serta untuk admin yang dapat mengakses dashboard setelah login. Sebelum masuk ke halaman utama, pengguna diingatkan untuk memeriksa tanggal service aset melalui sebuah alert penting. Fitur monitoring pada website ini menampilkan data kendaraan, AC, dan pengolah data, lengkap dengan waktu menuju service, serta informasi kontak kantor dan peta lokasi. <br> <br> Setelah login, admin diarahkan ke halaman profil dan mendapatkan akses penuh untuk mengelola data melalui dashboard yang intuitif. Admin dapat melakukan CRUD (Create, Read, Update, Delete) pada data AC, kendaraan, dan pengolah data, serta mencetak laporan dalam format CSV, Excel, PDF, atau langsung dicetak. Website ini juga menyediakan manajemen user dan panduan tata cara pengelolaan data yang mudah diakses melalui sidebar. SIMPERA-SP dirancang untuk memastikan semua aset terkelola dengan baik dan operasional berjalan lancar."
        },
        {
            "id": 8,
            "nama": "CosmeticsSafety Dashboard",
            "foto": "assets/img/portfolio/portofolio-si_produkhalal_dash.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-si_produkhalal_dash-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-si_produkhalal_dash-2.png",
            "filter": "filter-web",
            "tools": "CodeIgniter, PHP, Bootstrap, HTML, CSS, JavaScript",
            "kategori": "Web",
            "client": "Project Akhir Framework Programming",
            "date_project": "2022",
            "url_project": "https://github.com/ZuyinatinK/pengecekan-produk-kosmetik",
            "keterangan": "CosmeticsSafety Dashboard adalah halaman manajemen data yang terhubung langsung dengan website CosmeticsSafety, dirancang khusus untuk admin yang memiliki akses login. Setelah login, admin akan diarahkan ke halaman dashboard home yang memberikan gambaran lengkap mengenai jumlah jenis produk, jumlah produk, dan jumlah produsen, serta deskripsi singkat mengenai website. Dashboard ini dilengkapi dengan fitur CRUD (Create, Read, Update, Delete) untuk memudahkan admin dalam mengelola data jenis produk, produsen, produk beserta foto terkait, serta data komposisi. Dengan desain yang user-friendly, CosmeticsSafety Dashboard memastikan pengelolaan data yang efisien dan terstruktur."
        },
        {
            "id": 9,
            "nama": "Poster Transformasi Digital",
            "foto": "assets/img/portfolio/portofolio-poster-teknologi.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-poster-teknologi-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-poster-teknologi-2.png",
            "filter": "filter-design",
            "tools": "Figma, Photoshop, Canva",
            "kategori": "Design",
            "client": "MTsN 2 Blitar",
            "date_project": "2024",
            "url_project": "https://dribbble.com/shots/24619682-Poster-Transformasi-Digital",
            "keterangan": "Poster ini dirancang untuk mengedukasi tentang pentingnya transformasi digital di kalangan remaja Gen Z. Poster ini memaparkan pengertian transformasi digital, dampak positif dan negatifnya, serta upaya pemerintah dalam mendukung proses ini. Saya juga menyertakan fakta menarik berdasarkan survei APJII tahun 2024 yang menunjukkan bahwa 79,5% masyarakat Indonesia menggunakan internet, dengan mayoritas pengguna adalah Gen Z sebesar 34,4%, menjadikan mereka kekuatan pendorong utama dalam transformasi digital di Indonesia."
        },
        {
            "id": 10,
            "nama": "Poster UMKM Kampung Wisata Keramik Dinoyo",
            "foto": "assets/img/portfolio/portofolio-poster-umkm.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-poster-umkm-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-poster-umkm-2.png",
            "filter": "filter-design",
            "tools": "Figma, Photoshop, Canva",
            "kategori": "Design",
            "client": "Wisata Keramik Kalurahan Dinoyo",
            "date_project": "2022",
            "url_project": "https://dribbble.com/shots/24619657-Poster-UMKM-Kampung-Wisata-Keramik-Dinoyo",
            "keterangan": "Poster ini dirancang untuk mempromosikan UMKM di kampung wisata keramik Dinoyo, yang merupakan lokasi KKM-DR kami. Desain ini berisi penjelasan singkat tentang potensi UMKM lokal, termasuk paket wisata edukasi, jenis-jenis keramik yang dihasilkan, serta informasi mengenai jumlah toko keramik yang tersedia di daerah tersebut. Tujuan dari poster ini adalah untuk membantu memajukan sektor UMKM di kampung wisata ini, sekaligus menarik minat wisatawan untuk berkunjung dan mendukung produk lokal."
        },
        {
            "id": 11,
            "nama": "Poster Pencegahan Covid-19",
            "foto": "assets/img/portfolio/portofolio-poster-covid.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-poster-covid-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-poster-covid-2.png",
            "filter": "filter-design",
            "tools": "Figma, Photoshop, Canva",
            "kategori": "Design",
            "client": "KKM-DR Kalurahan Dinoyo",
            "date_project": "2022",
            "url_project": "https://dribbble.com/shots/24619476-Poster-Pencegahan-Covid-19",
            "keterangan": "Poster ini saya buat untuk menginformasikan waspada akan penyebaran virus, cara penularan, gejala umum, hingga kasus-kasus parah. Selain itu, poster ini juga menyajikan rekomendasi pencegahan yang diambil berdasarkan pedoman WHO tahun 2020. Dengan desain yang informatif dan visual yang menarik, poster ini bertujuan untuk meningkatkan kesadaran masyarakat dalam mencegah penularan Covid-19."
        },
        {
            "id": 12,
            "nama": "ID Card - Rawindra KKM-DR",
            "foto": "assets/img/portfolio/portofolio-id-card.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-id-card-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-id-card-2.png",
            "filter": "filter-design",
            "tools": "Figma, Photoshop, Canva",
            "kategori": "Design",
            "client": "KKM-DR Kalurahan Dinoyo",
            "date_project": "2022",
            "url_project": "https://dribbble.com/shots/24618666-ID-Card-Rawindra-KKM-DR",
            "keterangan": "Saya merancang ID card untuk seluruh anggota kelompok KKM-DR kami bernama ''Rawindra'', yang memiliki makna cahaya matahari. Desain ini dibuat untuk digunakan saat menghadiri setiap acara atau kegiatan kelompok, mencerminkan identitas dan semangat kerja sama kami selama menjalani program KKM-DR. ID card ini tidak hanya berfungsi sebagai tanda pengenal, tetapi juga sebagai simbol kebersamaan dan dedikasi kami dalam menjalankan tugas."
        },
        {
            "id": 13,
            "nama": "Covid-19 Prevention Brochure in the New Normal Era",
            "foto": "assets/img/portfolio/portofolio-brosur.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-brosur-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-brosur-2.png",
            "filter": "filter-design",
            "tools": "Figma, Photoshop, Canva",
            "kategori": "Design",
            "client": "KKM-DR Kalurahan Dinoyo",
            "date_project": "2022",
            "url_project": "https://dribbble.com/shots/24616800-Brochure-to-prevent-the-spread-of-Covid-19-in-the-new-normal-era",
            "keterangan": "Pada proyek ini, saya merancang sebuah stiker khusus untuk botol handsanitizer yang digunakan dalam acara-acara penting di lingkungan warga, seperti posyandu. Desain ini bertujuan untuk menekankan pentingnya kebersihan tangan dalam setiap aktivitas, terutama di masa pandemi. Stiker ini tidak hanya berfungsi sebagai label, tetapi juga sebagai pengingat visual bagi masyarakat untuk selalu menjaga kebersihan tangan demi kesehatan bersama."
        },
        {
            "id": 14,
            "nama": "Banner for Socialization and Education On Preventing Covid-19",
            "foto": "assets/img/portfolio/portofolio-benner.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-benner-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-benner-2.png",
            "filter": "filter-design",
            "tools": "Figma, Photoshop, Canva",
            "kategori": "Design",
            "client": "KKM-DR Kalurahan Dinoyo",
            "date_project": "2022",
            "url_project": "https://dribbble.com/shots/24616600-Banner-for-Socialization-and-Education-On-Preventing-Covid-19",
            "keterangan": "Saya menciptakan desain banner sosialisasi untuk kegiatan edukasi pencegahan Covid-19 di SDN Dinoyo 4. Banner ini berfokus pada langkah-langkah praktis yang dapat diambil oleh setiap individu untuk melindungi diri dan orang lain dari virus, terutama di era new normal. Desain ini dibuat dengan elemen visual yang sederhana namun informatif, agar pesan-pesan pencegahan dapat dipahami dengan mudah oleh semua kalangan, khususnya siswa sekolah dasar."
        },
        {
            "id": 15,
            "nama": "Stiker Handsanitizer",
            "foto": "assets/img/portfolio/portofolio-stiker.png",
            "foto_detail_1": "assets/img/portfolio/portfolio-details-stiker-1.png",
            "foto_detail_2": "assets/img/portfolio/portfolio-details-stiker-2.png",
            "filter": "filter-design",
            "tools": "Figma, Photoshop, Canva",
            "kategori": "Design",
            "client": "KKM-DR Kalurahan Dinoyo",
            "date_project": "2022",
            "url_project": "https://dribbble.com/shots/24616554-Stiker-Handsanitizer",
            "keterangan": "Pada proyek ini, saya merancang sebuah stiker khusus untuk botol handsanitizer yang digunakan dalam acara-acara penting di lingkungan warga, seperti posyandu. Desain ini bertujuan untuk menekankan pentingnya kebersihan tangan dalam setiap aktivitas, terutama di masa pandemi. Stiker ini tidak hanya berfungsi sebagai label, tetapi juga sebagai pengingat visual bagi masyarakat untuk selalu menjaga kebersihan tangan demi kesehatan bersama."
        }
    ]
}